In [90]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [91]:
sales = np.random.randint(10, 100, [3,4])
sales

array([[95, 26, 87, 38],
       [20, 35, 10, 29],
       [12, 75, 89, 13]])

In [92]:
sales = np.random.randint(10, 100, 12)
sales

array([97, 86, 79, 56, 89, 40, 42, 57, 86, 11, 70, 86])

In [93]:
sales = sales.reshape((3,4))

In [94]:
row_idx = list('xyz')
col_names = list('abcd')
col_names

['a', 'b', 'c', 'd']

In [95]:
df = pd.DataFrame(sales, index=row_idx, columns=col_names)
df

    a   b   c   d
x  97  86  79  56
y  89  40  42  57
z  86  11  70  86

In [96]:
cols = 'id name whsl_price retail_price unit_sales'.split()
cols

['id', 'name', 'whsl_price', 'retail_price', 'unit_sales']

In [97]:
ids = [id for id in range(11,16, 1 )]
ids

[11, 12, 13, 14, 15]

In [98]:
ids_series = pd.Series(ids)
ids_series

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [99]:
import sys
print(sys.version_info[0])
if sys.version_info[0] < 3: 
    print(sys.version_info[0])
    from StringIO import StringIO
else:
    from io import StringIO

data = StringIO("""id, name,whsl_price,retail_price,unit_sales
11,A,234,544, 192
12,B,23,66, 24
13,C,98, 190, 45
14,D, 787, 984, 33
14,E, 885, 987, 21
""")
df = pd.read_csv(data)
df

3

   id  name  whsl_price  retail_price  unit_sales
0  11     A         234           544         192
1  12     B          23            66          24
2  13     C          98           190          45
3  14     D         787           984          33
4  14     E         885           987          21

In [100]:
df.columns

Index(['id', ' name', 'whsl_price', 'retail_price', 'unit_sales'], dtype='object')

In [101]:
df['gross_profit'] = (df['retail_price'] - df['whsl_price'] ) * df['unit_sales'] 
df

   id  name  whsl_price  retail_price  unit_sales  gross_profit
0  11     A         234           544         192         59520
1  12     B          23            66          24          1032
2  13     C          98           190          45          4140
3  14     D         787           984          33          6501
4  14     E         885           987          21          2142

In [102]:
df['gross_profit'].sum()

np.int64(73335)

In [103]:
df = DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [104]:
df['gross_profit'] = (df['retail_price'] - df['wholesale_price']) * df['sales']
df

,product_id,name,wholesale_price,retail_price,sales,gross_profit
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,600.0

In [105]:
df['gross_profit'].sum()

np.float64(110700.0)

In [106]:
# For what products is the retail price more than twice the wholesale price?
df[(df['retail_price'] > (2 * df['wholesale_price']))]

,product_id,name,wholesale_price,retail_price,sales,gross_profit
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0

In [107]:
# How much did the store make from food versus computers versus books? (You
# can retrieve based on the index values, not anything more sophisticated.)

In [108]:
categories = {'categories': "computer book book food food".split()}
categories

{'categories': ['computer', 'book', 'book', 'food', 'food']}

In [109]:
catdf = DataFrame(categories)

In [110]:
df = df.join(catdf)
df

,product_id,name,wholesale_price,retail_price,sales,gross_profit,categories
0,23,computer,500.0,1000,100,50000.0,computer
1,96,Python Workout,35.0,75,1000,40000.0,book
2,97,Pandas Workout,35.0,75,500,20000.0,book
3,15,banana,0.5,1,200,100.0,food
4,87,sandwich,3.0,5,300,600.0,food

In [111]:
df.groupby('categories').sum()

,product_id,name,wholesale_price,retail_price,sales,gross_profit
categories,,,,,,
book,193,Python WorkoutPandas Workout,70.0,150,1500,60000.0
computer,23,computer,500.0,1000,100,50000.0
food,102,bananasandwich,3.5,6,500,700.0

In [114]:
((df['retail_price'] - df['wholesale_price'])*df['sales'])[[1,2]].sum()

np.float64(60000.0)

In [115]:
((df['retail_price'] - df['wholesale_price'])*df['sales'])[[3,4]].sum()

np.float64(700.0)

In [116]:
# Because your store is doing so well, you can negotiate a 30% discount on the
# wholesale price of goods. Calculate the new net income.

In [118]:
((df['retail_price'] - (0.7* df['wholesale_price']))*df['sales']).sum()

np.float64(141750.0)